{
  "architectures": [
    "RobertaForRegression"
  ],
  "attention_probs_dropout_prob": 0.109,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.144,
  "hidden_size": 384,
  "id2label": {
    "0": "LABEL_0",
    "1": "LABEL_1",
    "2": "LABEL_2",
    "3": "LABEL_3",
    "4": "LABEL_4",
    "5": "LABEL_5",
    "6": "LABEL_6",
    "7": "LABEL_7",
    "8": "LABEL_8",
    "9": "LABEL_9",
    "10": "LABEL_10",
    "11": "LABEL_11",
    "12": "LABEL_12",
    "13": "LABEL_13",
    "14": "LABEL_14",
    "15": "LABEL_15",
    "16": "LABEL_16",
    "17": "LABEL_17",
    "18": "LABEL_18",
    "19": "LABEL_19",
    "20": "LABEL_20",
    "21": "LABEL_21",
    "22": "LABEL_22",
    "23": "LABEL_23",
    "24": "LABEL_24",
    "25": "LABEL_25",
    "26": "LABEL_26",
    "27": "LABEL_27",
    "28": "LABEL_28",
    "29": "LABEL_29",
    "30": "LABEL_30",
    "31": "LABEL_31",
    "32": "LABEL_32",
    "33": "LABEL_33",
    "34": "LABEL_34",
    "35": "LABEL_35",
    "36": "LABEL_36",
    "37": "LABEL_37",
    "38": "LABEL_38",
    "39": "LABEL_39",
    "40": "LABEL_40",
    "41": "LABEL_41",
    "42": "LABEL_42",
    "43": "LABEL_43",
    "44": "LABEL_44",
    "45": "LABEL_45",
    "46": "LABEL_46",
    "47": "LABEL_47",
    "48": "LABEL_48",
    "49": "LABEL_49",
    "50": "LABEL_50",
    "51": "LABEL_51",
    "52": "LABEL_52",
    "53": "LABEL_53",
    "54": "LABEL_54",
    "55": "LABEL_55",
    "56": "LABEL_56",
    "57": "LABEL_57",
    "58": "LABEL_58",
    "59": "LABEL_59",
    "60": "LABEL_60",
    "61": "LABEL_61",
    "62": "LABEL_62",
    "63": "LABEL_63",
    "64": "LABEL_64",
    "65": "LABEL_65",
    "66": "LABEL_66",
    "67": "LABEL_67",
    "68": "LABEL_68",
    "69": "LABEL_69",
    "70": "LABEL_70",
    "71": "LABEL_71",
    "72": "LABEL_72",
    "73": "LABEL_73",
    "74": "LABEL_74",
    "75": "LABEL_75",
    "76": "LABEL_76",
    "77": "LABEL_77",
    "78": "LABEL_78",
    "79": "LABEL_79",
    "80": "LABEL_80",
    "81": "LABEL_81",
    "82": "LABEL_82",
    "83": "LABEL_83",
    "84": "LABEL_84",
    "85": "LABEL_85",
    "86": "LABEL_86",
    "87": "LABEL_87",
    "88": "LABEL_88",
    "89": "LABEL_89",
    "90": "LABEL_90",
    "91": "LABEL_91",
    "92": "LABEL_92",
    "93": "LABEL_93",
    "94": "LABEL_94",
    "95": "LABEL_95",
    "96": "LABEL_96",
    "97": "LABEL_97",
    "98": "LABEL_98",
    "99": "LABEL_99",
    "100": "LABEL_100",
    "101": "LABEL_101",
    "102": "LABEL_102",
    "103": "LABEL_103",
    "104": "LABEL_104",
    "105": "LABEL_105",
    "106": "LABEL_106",
    "107": "LABEL_107",
    "108": "LABEL_108",
    "109": "LABEL_109",
    "110": "LABEL_110",
    "111": "LABEL_111",
    "112": "LABEL_112",
    "113": "LABEL_113",
    "114": "LABEL_114",
    "115": "LABEL_115",
    "116": "LABEL_116",
    "117": "LABEL_117",
    "118": "LABEL_118",
    "119": "LABEL_119",
    "120": "LABEL_120",
    "121": "LABEL_121",
    "122": "LABEL_122",
    "123": "LABEL_123",
    "124": "LABEL_124",
    "125": "LABEL_125",
    "126": "LABEL_126",
    "127": "LABEL_127",
    "128": "LABEL_128",
    "129": "LABEL_129",
    "130": "LABEL_130",
    "131": "LABEL_131",
    "132": "LABEL_132",
    "133": "LABEL_133",
    "134": "LABEL_134",
    "135": "LABEL_135",
    "136": "LABEL_136",
    "137": "LABEL_137",
    "138": "LABEL_138",
    "139": "LABEL_139",
    "140": "LABEL_140",
    "141": "LABEL_141",
    "142": "LABEL_142",
    "143": "LABEL_143",
    "144": "LABEL_144",
    "145": "LABEL_145",
    "146": "LABEL_146",
    "147": "LABEL_147",
    "148": "LABEL_148",
    "149": "LABEL_149",
    "150": "LABEL_150",
    "151": "LABEL_151",
    "152": "LABEL_152",
    "153": "LABEL_153",
    "154": "LABEL_154",
    "155": "LABEL_155",
    "156": "LABEL_156",
    "157": "LABEL_157",
    "158": "LABEL_158",
    "159": "LABEL_159",
    "160": "LABEL_160",
    "161": "LABEL_161",
    "162": "LABEL_162",
    "163": "LABEL_163",
    "164": "LABEL_164",
    "165": "LABEL_165",
    "166": "LABEL_166",
    "167": "LABEL_167",
    "168": "LABEL_168",
    "169": "LABEL_169",
    "170": "LABEL_170",
    "171": "LABEL_171",
    "172": "LABEL_172",
    "173": "LABEL_173",
    "174": "LABEL_174",
    "175": "LABEL_175",
    "176": "LABEL_176",
    "177": "LABEL_177",
    "178": "LABEL_178",
    "179": "LABEL_179",
    "180": "LABEL_180",
    "181": "LABEL_181",
    "182": "LABEL_182",
    "183": "LABEL_183",
    "184": "LABEL_184",
    "185": "LABEL_185",
    "186": "LABEL_186",
    "187": "LABEL_187",
    "188": "LABEL_188",
    "189": "LABEL_189",
    "190": "LABEL_190",
    "191": "LABEL_191",
    "192": "LABEL_192",
    "193": "LABEL_193",
    "194": "LABEL_194",
    "195": "LABEL_195",
    "196": "LABEL_196",
    "197": "LABEL_197",
    "198": "LABEL_198",
    "199": "LABEL_199",
    "200": "LABEL_200",
    "201": "LABEL_201",
    "202": "LABEL_202",
    "203": "LABEL_203",
    "204": "LABEL_204",
    "205": "LABEL_205",
    "206": "LABEL_206",
    "207": "LABEL_207",
    "208": "LABEL_208",
    "209": "LABEL_209",
    "210": "LABEL_210",
    "211": "LABEL_211",
    "212": "LABEL_212",
    "213": "LABEL_213",
    "214": "LABEL_214",
    "215": "LABEL_215",
    "216": "LABEL_216"
  },
  "initializer_range": 0.02,
  "intermediate_size": 464,
  "is_gpu": true,
  "label2id": {
    "LABEL_0": 0,
    "LABEL_1": 1,
    "LABEL_10": 10,
    "LABEL_100": 100,
    "LABEL_101": 101,
    "LABEL_102": 102,
    "LABEL_103": 103,
    "LABEL_104": 104,
    "LABEL_105": 105,
    "LABEL_106": 106,
    "LABEL_107": 107,
    "LABEL_108": 108,
    "LABEL_109": 109,
    "LABEL_11": 11,
    "LABEL_110": 110,
    "LABEL_111": 111,
    "LABEL_112": 112,
    "LABEL_113": 113,
    "LABEL_114": 114,
    "LABEL_115": 115,
    "LABEL_116": 116,
    "LABEL_117": 117,
    "LABEL_118": 118,
    "LABEL_119": 119,
    "LABEL_12": 12,
    "LABEL_120": 120,
    "LABEL_121": 121,
    "LABEL_122": 122,
    "LABEL_123": 123,
    "LABEL_124": 124,
    "LABEL_125": 125,
    "LABEL_126": 126,
    "LABEL_127": 127,
    "LABEL_128": 128,
    "LABEL_129": 129,
    "LABEL_13": 13,
    "LABEL_130": 130,
    "LABEL_131": 131,
    "LABEL_132": 132,
    "LABEL_133": 133,
    "LABEL_134": 134,
    "LABEL_135": 135,
    "LABEL_136": 136,
    "LABEL_137": 137,
    "LABEL_138": 138,
    "LABEL_139": 139,
    "LABEL_14": 14,
    "LABEL_140": 140,
    "LABEL_141": 141,
    "LABEL_142": 142,
    "LABEL_143": 143,
    "LABEL_144": 144,
    "LABEL_145": 145,
    "LABEL_146": 146,
    "LABEL_147": 147,
    "LABEL_148": 148,
    "LABEL_149": 149,
    "LABEL_15": 15,
    "LABEL_150": 150,
    "LABEL_151": 151,
    "LABEL_152": 152,
    "LABEL_153": 153,
    "LABEL_154": 154,
    "LABEL_155": 155,
    "LABEL_156": 156,
    "LABEL_157": 157,
    "LABEL_158": 158,
    "LABEL_159": 159,
    "LABEL_16": 16,
    "LABEL_160": 160,
    "LABEL_161": 161,
    "LABEL_162": 162,
    "LABEL_163": 163,
    "LABEL_164": 164,
    "LABEL_165": 165,
    "LABEL_166": 166,
    "LABEL_167": 167,
    "LABEL_168": 168,
    "LABEL_169": 169,
    "LABEL_17": 17,
    "LABEL_170": 170,
    "LABEL_171": 171,
    "LABEL_172": 172,
    "LABEL_173": 173,
    "LABEL_174": 174,
    "LABEL_175": 175,
    "LABEL_176": 176,
    "LABEL_177": 177,
    "LABEL_178": 178,
    "LABEL_179": 179,
    "LABEL_18": 18,
    "LABEL_180": 180,
    "LABEL_181": 181,
    "LABEL_182": 182,
    "LABEL_183": 183,
    "LABEL_184": 184,
    "LABEL_185": 185,
    "LABEL_186": 186,
    "LABEL_187": 187,
    "LABEL_188": 188,
    "LABEL_189": 189,
    "LABEL_19": 19,
    "LABEL_190": 190,
    "LABEL_191": 191,
    "LABEL_192": 192,
    "LABEL_193": 193,
    "LABEL_194": 194,
    "LABEL_195": 195,
    "LABEL_196": 196,
    "LABEL_197": 197,
    "LABEL_198": 198,
    "LABEL_199": 199,
    "LABEL_2": 2,
    "LABEL_20": 20,
    "LABEL_200": 200,
    "LABEL_201": 201,
    "LABEL_202": 202,
    "LABEL_203": 203,
    "LABEL_204": 204,
    "LABEL_205": 205,
    "LABEL_206": 206,
    "LABEL_207": 207,
    "LABEL_208": 208,
    "LABEL_209": 209,
    "LABEL_21": 21,
    "LABEL_210": 210,
    "LABEL_211": 211,
    "LABEL_212": 212,
    "LABEL_213": 213,
    "LABEL_214": 214,
    "LABEL_215": 215,
    "LABEL_216": 216,
    "LABEL_22": 22,
    "LABEL_23": 23,
    "LABEL_24": 24,
    "LABEL_25": 25,
    "LABEL_26": 26,
    "LABEL_27": 27,
    "LABEL_28": 28,
    "LABEL_29": 29,
    "LABEL_3": 3,
    "LABEL_30": 30,
    "LABEL_31": 31,
    "LABEL_32": 32,
    "LABEL_33": 33,
    "LABEL_34": 34,
    "LABEL_35": 35,
    "LABEL_36": 36,
    "LABEL_37": 37,
    "LABEL_38": 38,
    "LABEL_39": 39,
    "LABEL_4": 4,
    "LABEL_40": 40,
    "LABEL_41": 41,
    "LABEL_42": 42,
    "LABEL_43": 43,
    "LABEL_44": 44,
    "LABEL_45": 45,
    "LABEL_46": 46,
    "LABEL_47": 47,
    "LABEL_48": 48,
    "LABEL_49": 49,
    "LABEL_5": 5,
    "LABEL_50": 50,
    "LABEL_51": 51,
    "LABEL_52": 52,
    "LABEL_53": 53,
    "LABEL_54": 54,
    "LABEL_55": 55,
    "LABEL_56": 56,
    "LABEL_57": 57,
    "LABEL_58": 58,
    "LABEL_59": 59,
    "LABEL_6": 6,
    "LABEL_60": 60,
    "LABEL_61": 61,
    "LABEL_62": 62,
    "LABEL_63": 63,
    "LABEL_64": 64,
    "LABEL_65": 65,
    "LABEL_66": 66,
    "LABEL_67": 67,
    "LABEL_68": 68,
    "LABEL_69": 69,
    "LABEL_7": 7,
    "LABEL_70": 70,
    "LABEL_71": 71,
    "LABEL_72": 72,
    "LABEL_73": 73,
    "LABEL_74": 74,
    "LABEL_75": 75,
    "LABEL_76": 76,
    "LABEL_77": 77,
    "LABEL_78": 78,
    "LABEL_79": 79,
    "LABEL_8": 8,
    "LABEL_80": 80,
    "LABEL_81": 81,
    "LABEL_82": 82,
    "LABEL_83": 83,
    "LABEL_84": 84,
    "LABEL_85": 85,
    "LABEL_86": 86,
    "LABEL_87": 87,
    "LABEL_88": 88,
    "LABEL_89": 89,
    "LABEL_9": 9,
    "LABEL_90": 90,
    "LABEL_91": 91,
    "LABEL_92": 92,
    "LABEL_93": 93,
    "LABEL_94": 94,
    "LABEL_95": 95,
    "LABEL_96": 96,
    "LABEL_97": 97,
    "LABEL_98": 98,
    "LABEL_99": 99
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 515,
  "model_type": "roberta",
  "norm_mean": [
    13.852700761459282,
    13.852700761459282,
    0.0370972175127779,
    -0.49264083981061696,
    0.045944776432848625,
    14.054697667549666,
    828.7964270714357,
    731.5222545776073,
    828.1865753263794,
    344.1489150057105,
    0.0,
    0.3096028726643034,
    -0.4621150970091523,
    0.46304179632508863,
    0.3086761733483671,
    0.5771332741355479,
    1.0598535527454167,
    1.6020700264496492,
    16.849106261173123,
    9.976359988686887,
    2.2908912195502382,
    -2.335159872265977,
    2.2097215359117808,
    -2.5136266743374653,
    5.8991437193299845,
    -0.1447340329787987,
    3.3293155471750016,
    3.079044581854713,
    1027.1621149963905,
    42.797779760222,
    39.37938275227086,
    39.3959876269226,
    28.78779741469058,
    25.420785516080965,
    25.4573189039678,
    17.921627661451737,
    17.96759265994356,
    12.0501293660913,
    12.0824628682993,
    8.310723169394322,
    8.336211778836125,
    -2.0498180009578895,
    2.212903084701365e+20,
    54.889914447525946,
    40.98160856548799,
    33.78960284624316,
    363.9729885314752,
    22.548483767262088,
    6.833110733622898,
    0.3210792587514578,
    10.117266744946871,
    0.01523422543766737,
    6.896407897525583,
    15.363559684465173,
    0.8959025415780657,
    0.5263550674119477,
    0.31053404936877477,
    165.4020019997722,
    90.23395850490726,
    36.54980918145472,
    9.471736700297553,
    20.512629676566814,
    17.29371876512166,
    0.0,
    18.115413846569844,
    2.254153986836324,
    245.95432466399555,
    43.71023621635514,
    17.22363398551533,
    0.0,
    0.4213292158415356,
    7.919825657605978,
    0.20251377029321457,
    0.0,
    0.00433330322712711,
    82.20222268610796,
    20.89304538993573,
    2.0403571050231193,
    235.26933901310676,
    16.953803431502354,
    0.0,
    0.0,
    0.0,
    92.2252042883985,
    6.038353931566146,
    14.58705486664137,
    0.006712316729717764,
    22.383760878499373,
    37.13804326644988,
    91.0557228578869,
    124.1283608049775,
    2.9368247683786035,
    9.783873126226004,
    50.77173379830858,
    6.654999741138185,
    7.769144047189108,
    0.0007422317109595289,
    42.70883334905963,
    6.164701919007585,
    0.7084621825621548,
    0.266950609975259,
    0.14763888988927099,
    42.94090345025881,
    11.789852446045165,
    1.420699376432759,
    0.8891190764104214,
    58.830342998194745,
    1.7245330287735328,
    7.995100025789338,
    0.3699664738606639,
    0.5097446855542865,
    0.8797111594149505,
    1.7152857090225841,
    0.020152525513023614,
    0.15967284382713776,
    0.17982536934016136,
    1.0720627786169545,
    0.31529307740485574,
    6.279814316766754,
    1.612275724864606,
    8.015436760859153,
    0.6694175293814243,
    42.12224146188704,
    0.3699664738606639,
    0.5095604759974948,
    0.8795269498581586,
    0.0,
    1.0720627786169545,
    38.34889242009209,
    1.0595365287551117,
    12.80722362745458,
    250.24589982315803,
    0.0,
    0.13226246177651696,
    0.13226246177651696,
    0.0,
    0.0,
    0.29981947463434405,
    0.0003684191135836127,
    0.0,
    0.0,
    0.0,
    2.8696901595254762,
    2.8696901595254762,
    0.0,
    0.00018420955679180636,
    0.00018420955679180636,
    2.225472497513171,
    1.3677559591791622,
    0.1122573039089268,
    0.0,
    0.15293077404855765,
    0.2541723464613344,
    0.0003684191135836127,
    0.0,
    0.0,
    0.0,
    0.0,
    2.1454518660428104,
    1.7152857090225841,
    0.00018420955679180636,
    0.010831521939358215,
    0.133183509560476,
    0.0,
    0.0,
    0.0,
    0.020152525513023614,
    0.0,
    0.030836679806948385,
    0.0,
    0.0,
    0.0,
    1.1252993405297866,
    1.2477250119736212,
    0.0,
    0.0,
    0.0,
    0.030836679806948385,
    0.0,
    0.03776295914232031,
    0.0,
    0.0,
    0.0,
    0.0,
    0.0,
    0.0,
    0.0,
    0.0022841985042183987,
    0.058136536123494086,
    0.0,
    0.0,
    0.0,
    0.0,
    0.0,
    0.0,
    0.0,
    0.0,
    0.0,
    0.0,
    0.0,
    0.0,
    0.18726743543455035,
    0.09866263861769149,
    0.0,
    0.0,
    0.019526213019931474,
    0.0,
    0.0003684191135836127,
    0.0,
    0.01996831595623181,
    0.014589396897911064,
    0.0,
    0.0,
    0.0,
    0.0,
    22.714806764174927,
    0.0
  ],
  "norm_std": [
    0.5460575935390197,
    0.5460575935390197,
    0.030163448886602315,
    0.40120269240434553,
    0.023284737985896458,
    2.5284310217805053,
    142.09398380889496,
    126.26699452421951,
    141.98602087337545,
    58.463429843854435,
    1.0,
    0.032545151893978205,
    0.018586091591047585,
    0.019772900266492845,
    0.02700506244361015,
    0.09238915835052493,
    0.14720873812976903,
    0.20279143031563557,
    2.2166407375378316,
    0.13512983681768126,
    0.0827591766011232,
    0.08303862668217171,
    0.10384243799944948,
    0.04991395393911716,
    0.2921432635433364,
    0.004878962824687111,
    0.26995848517773496,
    1.26744276403779,
    254.3548255139771,
    7.3196189760852395,
    6.712800217682646,
    6.717675360424492,
    5.0036799513105334,
    4.429607766625287,
    4.444362215755822,
    3.2145019220002196,
    3.24433368733847,
    2.31637074843217,
    2.3373460995371573,
    1.84145629761571,
    1.8561262250552137,
    0.6700253948114127,
    1.6124180273542013e+22,
    9.543046500904246,
    8.195733286219648,
    7.661838546601868,
    62.53123005260587,
    5.684265042113071,
    5.157760266724705,
    1.7764468842595684,
    2.9713959151695186,
    0.2996012008558369,
    3.0044180693602742,
    4.55834103792239,
    2.563073970729646,
    1.591026065655712,
    1.7515675538359432,
    34.26803151792821,
    33.618458672734455,
    14.231093402660855,
    5.538889540277851,
    6.442866878402703,
    4.413909878198799,
    1.0,
    4.157112148874044,
    5.1396016866807095,
    48.62341309598652,
    16.088815019702643,
    19.2862510863435,
    1.0,
    2.526768768408253,
    4.207421791631601,
    1.1712120377215673,
    1.0,
    0.22572101151348067,
    20.342387896056344,
    6.3289574114374085,
    5.308926773607737,
    46.84249537600763,
    18.954657229700842,
    1.0,
    1.0,
    1.0,
    20.89555038012216,
    4.8641231526929145,
    4.453038911360484,
    0.18161748595653712,
    7.232721275401149,
    15.31899016720628,
    28.886380441524242,
    39.13149820942501,
    6.7868683245844,
    9.962165719651487,
    19.920574216409804,
    3.8456940853934944,
    5.120554653791161,
    0.0386639777687355,
    11.163467817519486,
    4.549634063789998,
    2.051812959762048,
    1.279008455463354,
    1.6478301451664914,
    10.376879180417564,
    3.564802830914536,
    2.0854090446646527,
    0.057397226695930066,
    10.178505761367257,
    1.0556816713997659,
    1.6213136482964607,
    1.0570325145151271,
    0.5595157227425741,
    1.1847835863433425,
    0.49675108994876643,
    0.14052318307953465,
    0.3858975699676879,
    0.4073232350636471,
    0.3105136447716658,
    1.0586159150761854,
    1.4415741892470544,
    0.8327723574521259,
    1.6473303893584677,
    0.6085172236071066,
    8.006742582818145,
    1.0570325145151271,
    0.5595189007148779,
    1.184842608940125,
    1.0,
    0.3105136447716658,
    8.20777587325592,
    1.2058894036088426,
    2.954954332247629,
    43.18927936181536,
    1.0,
    0.4349635031190904,
    0.4349635031190904,
    1.0,
    1.0,
    0.7360772211066312,
    0.019190887556264122,
    1.0,
    1.0,
    1.0,
    0.7050938778599946,
    0.7050938778599946,
    1.0,
    0.0135712569935316,
    0.013571256993531632,
    1.0065660517574895,
    0.6240124559618855,
    0.3467212174821741,
    1.0,
    0.3739802988874684,
    0.4358218474997385,
    0.019190887556264122,
    1.0,
    1.0,
    1.0,
    1.0,
    2.7360892257023623,
    0.49675108994876643,
    0.013571256993531632,
    0.10351037359258627,
    0.37864821701172896,
    1.0,
    1.0,
    1.0,
    0.14052318307953465,
    1.0,
    0.3025901935575736,
    1.0,
    1.0,
    1.0,
    0.42846394894356615,
    0.6920194565402656,
    1.0,
    1.0,
    1.0,
    0.1728766309255616,
    1.0,
    0.19062420473875832,
    1.0,
    1.0,
    1.0,
    1.0,
    1.0,
    1.0,
    1.0,
    0.05491698028727952,
    0.23400360676709364,
    1.0,
    1.0,
    1.0,
    1.0,
    1.0,
    1.0,
    1.0,
    1.0,
    1.0,
    1.0,
    1.0,
    1.0,
    0.4628650649685778,
    0.29821126828725725,
    1.0,
    1.0,
    0.13836651581802636,
    1.0,
    0.019190887556263966,
    1.0,
    0.1398926117103094,
    0.11990334119893013,
    1.0,
    1.0,
    1.0,
    1.0,
    5.470617233174572,
    1.0
  ],
  "num_attention_heads": 12,
  "num_hidden_layers": 3,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.46.3",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 600
}
